#!/usr/bin/env python
# -*- coding:utf-8 -*-

"""
      百度失信人黑名单的爬取
"""
from time import strftime,gmtime
import elasticsearch
import requests
import sys
import collections
import time
import json
from requests.exceptions import ProxyError
default_encoding = 'utf-8'
if sys.getdefaultencoding() != default_encoding:
    reload(sys)
    sys.setdefaultencoding(default_encoding)
# 代理
proxies = {
  "HTTPS": "https://114.230.234.223:808",
  "HTTP": "http://110.73.6.124:8123",
  "HTTPS": "https://221.229.44.14:808",
  "HTTP": "http://116.226.90.12:808",
  "HTTPS": "https://218.108.107.70:909"
}
# headers
headers = {
    'Accept': 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,*/*;q=0.8',
    'Accept-Encoding': 'gzip, deflate, sdch',
    'Accept-Language': 'zh-CN,zh;q=0.8',
    'Cookie': 'JSESSIONID=9CAA8C2BEE80C74B1952EFA9E69C4150; '
              'wafenterurl=L3NzZncvZnltaC8xNDUxL3p4Z2suaHRtP3N0PTAmcT0mc3hseD0xJmJ6e'
              'HJseD0xJmNvdXJ0X2lkPSZienhybWM9JnpqaG09JmFoPSZzdGFydENwcnE9JmVuZENwcnE9JnBhZ2U9Mw==; '
              '__utma=161156077.495504895.1501221471.1501221471.1501221471.1; '
              '__utmc=161156077; '
              '__utmz=161156077.1501221471.1.1.utmcsr=(direct)|utmccn=(direct)|utmcmd=(none); '
              'wafcookie=6638c7e043d4634e31fc03f98c44d6c6; '
              'wafverify=1ac90afbc1da7e6e86e4f07057416bcb; '
              'wzwsconfirm=7711ddd10a544f8efa642db4685e86e8; '
              'wzwstemplate=OA==; '
              'clientlanguage=zh_CN; '
              'JSESSIONID=0E40DC7D29A84A4528787317B590F218; '
              'ccpassport=601fd92b79652fe0489b52310512d73b; '
              'wzwschallenge=-1; '
              'wzwsvtime=1501226469',
    'Host': 'www.ahgyss.cn',
    'Proxy-Connection': 'keep-alive',
    'Referer': 'http://www.ahgyss.cn/ssfw/fymh/1451/zxgk.htm'
               '?st=0&q=&sxlx=&bzxrlx=&court_id=&bzxrmc=&zjhm=&ah=&startCprq=&endCprq=&page=11',
    'User-Agent': 'Mozilla/5.0 (Windows NT 6.1; Win64; x64) '
                  'AppleWebKit/537.36 (KHTML, like Gecko) '
                  'Chrome/58.0.3029.110 Safari/537.36'
}

# es链接地址
class ElasticSearchClient(object):
    @classmethod
    def get_es_servers(cls):
        hosts = [
            {"host": "172.16.39.55", "port": 9200},
            {"host": "172.16.39.56", "port": 9200},
            {"host": "172.16.39.57", "port": 9200}
        ]
        es = elasticsearch.Elasticsearch(
            hosts,
            sniff_on_start=True,
            sniff_on_connection_fail=True,
            sniffer_timeout=6000,
            http_auth=('elastic', 'cgtz@bigdata')
        )
        return es


def is_chinese(s):
    """
    判断是否有中文
    :return:
    """
    for ch in s.decode('utf-8'):
        if u'\u4e00' <= ch <= u'\u9fff':
            return True
    return False


# es数据操作
class LoadElasticSearchTest(object):
    def __init__(self, index, doc_type):
        self.index = index
        self.doc_type = doc_type
        self.es_client = ElasticSearchClient.get_es_servers()

    # 如果返回结果>=1,这表明该黑名单已经存在了
    def search_data(self, id_card_no, name):
        return len(self.es_client.search(index="blacklist",
                                         body={"query": {"bool": {"filter": [{"term": {"ID_card_no": str(id_card_no)}},{ "term": { "name":  str(name) }}]}}})['hits']['hits'])

    def add_date(self, id, row_obj):
        """
        单条插入ES
        """
        resu = self.es_client.index(index=self.index, doc_type=self.doc_type, id=id, body=row_obj)
        return resu.get('created', '')


# 数据解析
def parse_data(html):
    # 一页的数据
    data_list = []
    # 具体数据
    rest = html["data"]
    rest = rest[0]["result"]
    if len(rest) > 0:
        try:
            for rs in rest:
                try:
                    result = collections.OrderedDict()
                    result['name'] = rs.get('iname', '')
                    result['ID_card_no'] = rs.get('cardNum', '')
                    id_card_no_pre = result.get('ID_card_no', '')
                    # 获取身份证，如果有
                    if id_card_no_pre:
                        result['ID_card_no_pre'] = id_card_no_pre[0: 6]
                    result['from_platform'] = rs.get('courtName', '')
                    result['case_code'] = rs.get('caseCode', '')
                    result['filing_time'] = rs.get('publishDate', '')
                    result['notes'] = rs.get('disruptTypeName', '')
                    result['involved_amt'] = rs.get('duty', '')
                    result['gender'] = rs.get('sexy', '')
                    result['address'] = rs.get('areaName', '')
                    data_list.append(result)
                except Exception as e:
                    print(e)
        except Exception as e:
            print(e)
    return data_list


# 爬取数据
def spider_data(url):
    try:
        try:
            # 使用代理
            res = requests.get(url, timeout=10, proxies=proxies)
        except ProxyError:
            print("ProxyError Exception ,use no proxies ")
            # 不使用代理
            res = requests.get(url, timeout=10)
        res = res.content
        res = res[:-2]
        res = res[46:]
        return json.loads(res)
    except Exception as e:
        print("爬取失败", e)
        return -1


# 数据最终结果的封装
def package_data(result):
    # 结果数据的封装
    message = collections.OrderedDict()
    if len(result) == 0:
        message["statue_code"] = 0
        message["msg_size"] = 0
    else:
        message["statue_code"] = 1
        message["msg_size"] = len(result)
        message["msg"] = result
    return json.dumps(message).decode("unicode-escape")


# 数据的解析,写到elastic中
def parse_data_write_es(rest):
    users = rest["msg"]
    if len(users) > 0:
        load_es = LoadElasticSearchTest('blacklist', 'promise')
        insert_count = 0
        for user in users:
            try:
                id_card = user.get('ID_card_no', '')
                name = user.get('name', '')
                if id_card and name and len(id_card) >= 6 and (not is_chinese(id_card)):
                    from_platform = user.get('from_platform', '').strip()
                    name = user.get('name', '').strip()
                    ID_card_no = user.get('ID_card_no', '').strip()
                    ID_card_no_pre = user.get('ID_card_no_pre', '').strip()
                    phone_no = user.get('phone_no', '').strip()
                    qq = user.get('qq', '').strip()
                    gender = user.get('gender', '').strip()
                    address = user.get('address', '').strip()
                    involved_amt = user.get('involved_amt', '').strip()
                    filing_time = user.get('filing_time', '').strip()
                    case_code = user.get('case_code', '').strip()
                    notes = user.get('notes', '').strip()

                    id = str(id_card) + str(name)
                    action = '{"from_platform": \"'+from_platform+'\", ' \
                              '"name": \"'+name+'\", ' \
                              '"ID_card_no": \"'+ID_card_no+'\", ' \
                              '"ID_card_no_pre": \"'+ID_card_no_pre+'\", ' \
                              '"phone_no": \"'+phone_no+'\", ' \
                              '"qq": \"'+qq+'\", ' \
                              '"gender": \"'+gender+'\", ' \
                              '"address": \"'+address+'\", ' \
                              '"involved_amt": \"'+involved_amt+'\", ' \
                              '"filing_time": \"'+filing_time+'\", ' \
                              '"case_code": \"'+case_code+'\",' \
                              '"notes": \"'+notes+'\"}'

                    if load_es.add_date(id, action) == True:
                        insert_count += 1
            except Exception as e:
                print(e)
        print('该批次共插入 '+str(insert_count)+' 条数据')


# 爬取每页的具体数据（处理超时异常,默认10次重试）
def re_spider_page_data(url_list):
    count = 1
    for url in url_list:
        try:
            html = spider_data(url)
            # 如果没有获取到数据则重试多次
            if html == -1:
                # 如果没有爬取成功则，重爬
                for num in range(1, 10):
                    time.sleep(8)
                    print(num)
                    if html == -1:
                        html = spider_data(url)
                    else:
                        break
            # 解析数据
            result = parse_data(html)
            # 包装数据
            result = package_data(result)
            result = json.loads(result)
            print('第 ' + str(count) + ' 页爬取，共 '+str(len(result["msg"]))+' 条数据====>')
            parse_data_write_es(result)
            time.sleep(1)
            count += 1
        except Exception as e:
            print(e)


if __name__ == '__main__':
    # 常用字
    # first_name_list = ['诚', '夫', '声', '冬', '奎', '扬', '双', '坤', '镇', '楚', '水', '铁', '喜', '之', '迪', '泰', '方', '同', '滨','邦',
    #                    '先', '聪', '朝', '善', '非', '恒', '晋', '汝', '丹', '为', '晨', '乃', '秀', '岩', '辰', '洋', '然', '厚', '灿','卓',
    #                    '轩', '帆', '若', '连', '勋', '祖', '锡', '吉', '崇', '钧', '田', '石', '奕', '发', '洲', '彪', '钢', '运', '伯','满',
    #                    '庭', '申', '湘', '皓', '承', '梓', '雪', '孟', '其', '潮', '冰', '怀', '鲁', '裕', '翰', '征', '谦', '航', '士','尧',
    #                    '标', '洁', '城', '寿', '枫', '革', '纯', '风', '化', '逸', '腾', '岳', '银', '鹤', '琳', '显', '焕', '来', '心','凤',
    #                    '睿', '勤', '延', '凌', '昊', '西', '羽', '百', '捷', '定', '琦', '圣', '佩', '麒', '虹', '如', '靖', '日', '咏','会',
    #                    '久', '昕', '黎', '桂', '玮', '燕', '可', '越', '彤', '雁', '孝', '宪', '萌', '颖', '艺', '夏', '桐', '月', '瑜','沛',
    #                    '杨', '钰', '兰', '怡', '灵', '淇', '美', '琪', '亦', '晶', '舒', '菁', '真', '涵', '爽', '雅', '爱', '依', '静','棋',
    #                    '宜', '男', '蔚', '芝', '菲', '露', '娜', '珊', '雯', '淑', '曼', '萍', '珠', '诗', '璇', '琴', '素', '梅', '玲','蕾',
    #                    '艳', '紫', '珍', '丽', '仪', '梦', '倩', '伊', '茜', '妍', '碧', '芬', '儿', '岚', '婷', '菊', '妮', '媛', '莲','娟'
    #                    ]
    # first_name_list = [
    #     '蕊','薇','菁','梦','岚','苑','婕','馨','瑗','琰','韵','融','园','艺','咏','卿','聪','澜','纯',
    #     '爽','琬','茗','羽','希','宁','欣','飘','育','滢','馥','筠','柔','竹','霭','凝','晓','欢','霄',
    #     '伊','亚','宜','可','姬','舒','影','荔','枝','思','丽','芬','芳','燕','莺','媛','艳','珊','莎',
    #     '秀','娟','英','华','慧','巧','美','娜','静','淑','惠','珠','翠','雅','芝','玉','萍','红','月',
    #     '彩','春','菊','兰','凤','洁','梅','琳','素','云','莲','真','环','雪','荣','爱','妹','霞','香',
    #     '瑞','凡','佳','嘉','琼','勤','珍','贞','莉','桂','娣','叶','璧','璐','娅','琦','晶','妍','茜',
    #     '黛','青','倩','婷','姣','婉','娴','瑾','颖','露','瑶','怡','婵','雁','蓓','纨','仪','荷','丹',
    #     '蓉','眉','君','琴','毓','悦','昭','冰','枫','芸','菲','寒','锦','玲','秋','梁','栋','维','启',
    #     '盛','雄','琛','钧','冠','策','腾','楠','榕','风','航','弘','义','兴','良','飞','彬','富','和',
    #     '伟','刚','勇','毅','俊','峰','强','军','平','保','东','文','辉','力','明','永','健','世','广',
    #     '海','山','仁','波','宁','福','生','龙','元','全','国','胜','学','祥','才','发','武','新','利',
    #     '顺','信','子','杰','涛','昌','成','康','星','光','天','达','安','岩','中','茂','进','林','有',
    #     '诚','先','敬','震','振','壮','会','思','群','豪','心','邦','承','乐','绍','功','松','善','厚',
    #     '裕','河','哲','江','超','浩','亮','政','谦','亨','奇','固','之','轮','翰','朗','伯','宏','言',
    #     '克','伦','翔','旭','鹏','泽','晨','辰','士','以','建','家','致','树','炎','鸣','朋','斌','行',
    #     '时','泰','博','磊','民','友','志','清','坚','庆','若','德','彪'
    # ]
    # first_name_list = [
    #     '唉', '峰', '圆', '贼', '贿', '钱', '钳', '钻', '铁', '铃', '铅', '缺', '氧', '特', '牺', '造', '敌', '秤', '租', '积', '秧', '秩',
    #     '秘', '透', '笋', '债',
    #     '借', '值', '倚', '倾', '倒', '倘', '俱', '倡', '候', '俯', '倍', '倦', '健', '笑', '躬', '息', '徒', '徐', '舰', '舱', '般', '航',
    #     '途', '爹', '颂', '翁',
    #     '脆', '脂', '胸', '胳', '脏', '胶', '脑', '狸', '狼', '逢', '留', '皱', '饿', '恋', '桨', '浆', '席', '座', '症', '病', '疾', '疼',
    #     '疲', '效', '唐', '资',
    #     '凉', '站', '剖', '部', '旁', '阅', '羞', '瓶', '拳', '粉', '烤', '烘', '烧', '烛', '烟', '递', '涛', '浙', '涝', '酒', '消', '浩',
    #     '海', '涂', '浴', '浮',
    #     '流', '润', '浪', '浸', '涨', '烫', '涌', '悟', '悄', '悔', '悦', '害', '宽', '宵', '宴', '宾', '窄', '案', '请', '朗', '诸', '袜',
    #     '袖', '袍', '被', '祥',
    #     '课', '谁', '调', '冤', '谅', '谈', '谊', '剥', '恳', '展', '剧', '屑', '陵', '陶', '陷', '陪', '娱', '娘', '通', '预', '绢', '绣',
    #     '验', '难', '球', '理',
    #     '捧', '堵', '描', '域', '掩', '捷', '排', '掉', '堆', '推', '掀', '授', '教', '掏', '掠', '培', '接', '控', '探', '据', '掘', '职',
    #     '基', '着', '勒', '萌',
    #     '萝', '菌', '菜', '萄', '菊', '萍', '菠', '营', '械', '梢', '梅', '检', '梳', '梯', '桶', '救', '副', '聋', '袭', '盛', '雪', '辅',
    #     '辆', '堂', '常', '匙',
    #     '晨', '睁', '眯', '眼', '悬', '啦', '晚', '啄', '距', '跃', '略', '蛇', '累', '唱', '患', '唯', '崖', '崭', '崇', '圈', '铜', '铲',
    #     '银', '梨', '犁', '移',
    #     '笨', '笼', '笛', '符', '第', '敏', '袋', '悠', '偿', '偶', '偷', '您', '停', '偏', '假', '得', '船', '斜', '盒', '鸽', '欲', '彩',
    #     '领', '脚', '脖', '脸',
    #     '脱', '够', '猜', '猪', '猎', '猫', '猛', '馅', '馆', '凑', '减', '毫', '痒', '痕', '廊', '粘', '粗', '粒', '剪', '清', '添', '淋',
    #     '淹', '渠', '渐', '混',
    #     '渔', '淘', '液', '淡', '深', '婆', '梁', '渗', '情', '惜', '惭', '悼', '惧', '惕', '惊', '惨', '惯', '寄', '窑', '密', '谋', '谎',
    #     '祸', '谜', '弹', '随',
    #     '隆', '隐', '婚', '婶', '颈', '绩', '绪', '续', '骑', '绳', '维', '绸', '绿', '盘', '屠', '斑', '堪', '搭', '塔', '越', '趁', '趋',
    #     '超', '提', '堤', '博',
    #     '揭', '插', '揪', '搜', '煮', '援', '裁', '搁', '搂', '搅', '握', '揉', '斯', '期', '欺', '散', '惹', '葛', '董', '葡', '葱', '落',
    #     '辜', '葵', '棒', '棋',
    #     '植', '椅', '椒', '棵', '棍', '棚', '棕', '惠', '惑', '逼', '厨', '厦', '硬', '确', '殖', '裂', '雄', '暂', '雅', '辈', '悲', '紫',
    #     '辉', '敞', '赏', '掌',
    #     '晴', '暑', '最', '量', '喷', '喇', '遇', '喊', '景', '践', '跌', '跑', '遗', '蛙', '蛛', '蜓', '喝', '喂', '喘', '喉', '幅', '帽',
    #     '赌', '赔', '铸', '铺',
    #     '链', '销', '锁', '锄', '锅', '锈', '锋', '锐', '智', '毯', '鹅', '剩', '稍', '程', '稀', '税', '筐', '策', '筛', '筒', '筝', '傲',
    #     '傅', '牌', '堡', '傍',
    #     '储', '街', '惩', '御', '循', '艇', '舒', '释', '腊', '脾', '腔', '猾', '猴', '然', '馋', '装', '蛮', '痛', '阔', '道', '焰', '港',
    #     '湖', '渣', '湿', '温',
    #     '渴', '滑', '湾', '渡', '游', '滋', '溉', '愤', '慌', '惰', '愧', '愉', '慨', '割', '富', '窜', '窝', '遍', '裕', '裤', '裙', '谢',
    #     '谣', '谦', '屡', '疏',
    #     '隔', '絮', '嫂', '缎', '缓', '编', '骗', '缘', '筑', '羡', '强', '瑞', '魂', '摄', '摸', '填', '搏', '塌', '鼓', '摆', '携', '搬',
    #     '摇', '搞', '塘', '摊',
    #     '蒜', '勤', '鹊', '蓝', '墓', '幕', '蓬', '蓄', '蒙', '蒸', '献', '禁', '想', '槐', '榆', '楼', '概', '赖', '酬', '感', '碑', '碎',
    #     '碰', '碗', '碌', '雷',
    #     '零', '雾', '雹', '输', '督', '龄', '睛', '睡', '睬', '鄙', '愚', '暖', '盟', '歇', '暗', '照', '跨', '跳', '跪', '路', '跟', '遣',
    #     '蛾', '蜂', '嗓', '置',
    #     '罪', '罩', '错', '锡', '锣', '锤', '锦', '键', '锯', '稠', '愁', '筹', '签', '简', '催', '傻', '像', '躲', '微', '愈', '遥', '腰',
    #     '腥', '腹', '腾', '腿',
    #     '酱', '痰', '廉', '新', '韵', '意', '粮', '数', '煎', '塑', '慈', '煤', '煌', '满', '漠', '源', '滤', '滥', '滔', '溪', '溜', '滚',
    #     '滨', '粱', '滩', '慎',
    #     '谨', '福', '群', '殿', '辟', '障', '嫌', '嫁', '缝', '缠', '毁', '舅', '静', '碧', '璃', '墙', '撇', '嘉', '摧', '截', '誓', '境',
    #     '摘', '摔', '聚', '蔽',
    #     '慕', '暮', '蔑', '模', '榴', '榜', '榨', '歌', '遭', '酷', '酿', '酸', '磁', '愿', '弊', '裳', '颗', '嗽', '蜻', '蜡', '蝇', '蜘',
    #     '赚', '锹', '锻', '稳',
    #     '算', '箩', '管', '僚', '鼻', '魄', '貌', '膜', '膊', '膀', '馒', '裹', '敲', '豪', '膏', '遮', '腐', '瘦', '辣', '竭', '端', '旗',
    #     '精', '歉', '熄', '熔',
    #     '漆', '漂', '漫', '滴', '演', '漏', '慢', '寨', '赛', '察', '蜜', '谱', '嫩', '翠', '熊', '凳', '骡', '缩', '慧', '撕', '撒', '趣',
    #     '趟', '撑', '播', '撞',
    #     '撤', '增', '聪', '鞋', '蕉', '蔬', '横', '槽', '樱', '橡', '飘', '醋', '醉', '震', '霉', '瞒', '题', '瞎', '影', '踢', '踏', '踩',
    #     '踪', '蝶', '蝴', '嘱',
    #     '镇', '靠', '稻', '稿', '稼', '箱', '箭', '篇', '僵', '躺', '僻', '德', '艘', '膝', '膛', '熟', '摩', '颜', '糊', '遵', '潜', '潮',
    #     '懂', '额', '慰', '劈',
    #     '操', '薯', '薪', '薄', '颠', '橘', '整', '融', '醒', '餐', '嘴', '蹄', '器', '赠', '默', '镜', '赞', '篮', '邀', '膨', '雕', '磨',
    #     '凝', '辨', '辩', '糖',
    #     '糕', '燃', '澡', '激', '懒', '壁', '避', '缴', '擦', '鞠', '藏', '霜', '霞', '瞧', '蹈', '螺', '穗', '繁', '辫', '赢', '糟', '糠',
    #     '燥', '臂', '翼', '骤',
    #     '鞭', '覆', '蹦', '镰', '翻', '鹰', '警', '攀', '蹲', '颤', '瓣', '爆', '疆', '耀', '躁', '嚼', '嚷', '籍', '魔', '灌', '蠢', '霸',
    #     '露', '囊', '罐', '啊',
    #     '怨', '急', '饶', '蚀', '饺', '饼', '弯', '将', '奖', '哀', '度', '迹', '庭', '疮', '疯', '疫', '疤', '姿', '亲', '施', '闻', '阀',
    #     '阁', '姜', '叛', '迷',
    #     '逆', '炼', '炸', '炮', '烂', '剃', '洁', '洪', '洒', '浇', '浊', '洞', '测', '洗', '活', '派', '洽', '济', '洋', '洲', '浑', '浓',
    #     '津', '恒', '恢', '恰',
    #     '恼', '恨', '觉', '宣', '室', '宫', '宪', '窃', '客', '语', '袄', '祖', '神', '祝', '误', '诱', '说', '诵', '垦', '退', '费', '陡',
    #     '孩', '除', '险', '院',
    #     '娃', '姥', '姨', '姻', '娇', '怒', '架', '贺', '勇', '怠', '柔', '垒', '绑', '绒', '结', '绕', '骄', '绘', '给', '络', '骆', '绞',
    #     '统', '耕', '耗', '泰',
    #     '珠', '班', '顽', '盏', '匪', '捞', '栽', '捕', '振', '载', '赶', '起', '捎', '捏', '捉', '捆', '捐', '损', '都', '哲', '逝', '捡',
    #     '换', '挽', '热', '恐',
    #     '挨', '耽', '恭', '莲', '荷', '恶', '框', '桂', '档', '桐', '株', '桥', '桃', '格', '校', '核', '样', '根', '速', '逗', '配', '翅',
    #     '唇', '础', '破', '晒',
    #     '眠', '晓', '鸭', '晃', '晌', '晕', '蚊', '哨', '烈', '殊', '顾', '轿', '较', '顿', '毙', '致', '柴', '桌', '虑', '恩', '唤',
    # ]
    first_name_list = [
        '一', '乙', '二', '十', '丁', '厂', '七', '卜', '八', '人', '入', '儿', '匕', '几', '九', '刁', '了', '刀', '力', '乃', '又', '三',
        '干', '于', '亏', '工', '土', '士', '才', '下', '寸', '大', '丈', '与', '万', '上', '小', '口', '山', '巾', '千', '乞', '川', '亿',
        '个', '夕', '久', '么', '勺', '凡', '丸', '及', '广', '亡', '门', '丫',
        '义', '之', '尸', '己', '已', '巳', '弓', '子', '卫', '也', '女', '刃', '飞', '习', '叉', '马', '乡', '丰', '王', '开', '井', '天',
        '夫', '元', '无', '云', '专', '丐', '扎', '艺', '木', '五', '支', '厅', '不', '犬', '太', '区', '历', '歹', '友', '尤', '匹', '车',
        '巨', '牙', '屯', '戈', '比', '互', '切', '瓦', '止', '少', '曰', '日',
        '中', '贝', '冈', '内', '水', '见', '午', '牛', '手', '气', '毛', '壬', '升', '夭', '长', '仁', '什', '片', '仆', '化', '仇', '币',
        '仍', '仅', '斤', '爪', '反', '介', '父', '从', '仑', '今', '凶', '分', '乏', '公', '仓', '月', '氏', '勿', '欠', '风', '丹', '匀',
        '乌', '勾', '凤', '六', '文', '亢', '方', '火', '为', '斗', '忆', '计',
        '订', '户', '认', '冗', '讥', '心', '尺', '引', '丑', '巴', '孔', '队', '办', '以', '允', '予', '邓', '劝', '双', '书', '幻', '玉',
        '刊', '未', '末', '示', '击', '打', '巧', '正', '扑', '卉', '扒', '功', '扔', '去', '甘', '世', '艾', '古', '节', '本', '术', '可',
        '丙', '左', '厉', '石', '右', '布', '夯', '戊', '龙', '平', '灭', '轧',
        '东', '卡', '北', '占', '凸', '卢', '业', '旧', '帅', '归', '旦', '目', '且', '叶', '甲', '申', '叮', '电', '号', '田', '由', '只',
        '叭', '史', '央', '兄', '叽', '叼', '叫', '叩', '叨', '另', '叹', '冉', '皿', '凹', '囚', '四', '生', '矢', '失', '乍', '禾', '丘',
        '付', '仗', '代', '仙', '们', '仪', '白', '仔', '他', '斥', '瓜', '乎',
        '丛', '令', '用', '甩', '印', '尔', '乐', '句', '匆', '册', '卯', '犯', '外', '处', '冬', '鸟', '务', '包', '饥', '主', '市', '立',
        '冯', '玄', '闪', '兰', '半', '汁', '汇', '头', '汉', '宁', '穴', '它', '讨', '写', '让', '礼', '训', '议', '必', '讯', '记', '永',
        '司', '尼', '民', '弗', '弘', '出', '辽', '奶', '奴', '召', '加', '皮',
        '边', '孕', '发', '圣', '对', '台', '矛', '纠', '母', '幼', '丝', '邦', '式', '迂', '刑', '戎', '动', '扛', '寺', '吉', '扣', '考',
        '托', '老', '巩', '圾', '执', '扩', '扫', '地', '场', '扬', '耳', '芋', '共', '芒', '亚', '芝', '朽', '朴', '机', '权', '过', '臣',
        '吏', '再', '协', '西', '压', '厌', '戌', '在', '百', '有', '存', '而',
        '页', '匠', '夸', '夺', '灰', '达', '列', '死', '成', '夹', '夷', '轨', '邪', '尧', '划', '迈', '毕', '至', '此', '贞', '师', '尘',
        '尖', '劣', '光', '当', '早', '吁', '吐', '吓', '虫', '曲', '团', '吕', '同', '吊', '吃', '因', '吸', '吗', '吆', '屿', '屹', '岁',
        '帆', '回', '岂', '则', '刚', '网', '肉', '年', '朱', '先', '丢', '廷',
        '舌', '竹', '迁', '乔', '迄', '伟', '传', '乒', '乓', '休', '伍', '伏', '优', '臼', '伐', '延', '仲', '件', '任', '伤', '价', '伦',
        '份', '华', '仰', '仿', '伙', '伪', '自', '伊', '血', '向', '似', '后', '行', '舟', '全', '会', '杀', '合', '兆', '企', '众', '爷',
        '伞', '创', '肌', '肋', '朵', '杂', '危', '旬', '旨', '旭', '负', '匈',
        '名', '各', '多', '争', '色', '壮', '冲', '妆', '冰', '庄', '庆', '亦', '刘', '齐', '交', '衣', '次', '产', '决', '亥', '充', '妄',
        '闭', '问', '闯', '羊', '并', '关', '米', '灯', '州', '汗', '污', '江', '汛', '池', '汝', '汤', '忙', '兴', '宇', '守', '宅', '字',
        '安', '讲', '讳', '军', '讶', '许', '讹', '论', '讼', '农', '讽', '设',
        '访', '诀', '寻', '那', '迅', '尽', '导', '异', '弛', '孙', '阵', '阳', '收', '阶', '阴', '防', '奸', '如', '妇', '妃', '好', '她',
        '妈', '戏', '羽', '观', '欢', '买', '红', '驮', '纤', '驯', '约', '级', '纪', '驰', '纫', '巡', '寿', '弄', '麦', '玖', '玛', '形',
        '进', '戒', '吞', '远', '违', '韧', '运', '扶', '抚', '坛', '技', '坏',
        '抠', '扰', '扼', '拒', '找', '批', '址', '扯', '走', '抄', '贡', '汞', '坝', '攻', '赤', '折', '抓', '扳', '抡', '扮', '抢', '孝',
        '坎', '均', '抑', '抛', '投', '坟', '坑', '抗', '坊', '抖', '护', '壳', '志', '块', '扭', '声', '把', '报', '拟', '却', '抒', '劫',
        '芙', '芜', '苇', '芽', '花', '芹', '芥', '芬', '苍', '芳', '严', '芦',
        '芯', '劳', '克', '芭', '苏', '杆', '杠', '杜', '材', '村', '杖', '杏', '杉', '巫', '极', '李', '杨', '求', '甫', '匣', '更', '束',
        '吾', '豆', '两', '酉', '丽', '医', '辰', '励', '否', '还', '尬', '歼', '来', '连', '轩', '步', '卤', '坚', '肖', '旱', '盯', '呈',
        '时', '吴', '助', '县', '里', '呆', '吱', '吠', '呕', '园', '旷', '围',
        '呀', '吨', '足', '邮', '男', '困', '吵', '串', '员', '呐', '听', '吟', '吩', '呛', '吻', '吹', '呜', '吭', '吧', '邑', '吼', '囤',
        '别', '吮', '岖', '岗', '帐', '财', '针', '钉', '牡', '告', '我', '乱', '利', '秃', '秀', '私', '每', '兵', '估', '体', '何', '佐',
        '佑', '但', '伸', '佃', '作', '伯', '伶', '佣', '低', '你', '住', '位',
        '伴', '身', '皂', '伺', '佛', '囱', '近', '彻', '役', '返', '余', '希', '坐', '谷', '妥', '含', '邻', '岔', '肝', '肛', '肚', '肘',
        '肠', '龟', '甸', '免', '狂', '犹', '狈', '角', '删', '条', '彤', '卵', '灸', '岛', '刨', '迎', '饭', '饮', '系', '言', '冻', '状',
        '亩', '况', '床', '库', '庇', '疗', '吝', '应', '这', '冷', '庐', '序',
        '辛', '弃', '冶', '忘', '闰', '闲', '间', '闷', '判', '兑', '灶', '灿', '灼', '弟', '汪', '沐', '沛', '汰', '沥', '沙', '汽', '沃',
        '沦', '汹', '泛', '沧', '没', '沟', '沪', '沈', '沉', '沁', '怀', '忧', '忱', '快', '完', '宋', '宏', '牢', '究', '穷', '灾', '良',
        '证', '启', '评', '补', '初', '社', '祀', '识', '诈', '诉', '罕', '诊',
        '词', '译', '君', '灵', '即', '层', '屁', '尿', '尾', '迟', '局', '改', '张', '忌', '际', '陆', '阿', '陈', '阻', '附', '坠', '妓',
        '妙', '妖', '姊', '妨', '妒', '努', '忍', '劲', '矣', '鸡', '纬', '驱', '纯', '纱', '纲', '纳', '驳', '纵', '纷', '纸', '纹', '纺',
        '驴', '纽', '奉', '玩', '环', '武', '青', '责', '现', '玫', '表', '规',
        '抹', '卦', '坷', '坯', '拓', '拢', '拔', '坪', '拣', '坦', '担', '坤', '押', '抽', '拐', '拖', '者', '拍', '顶', '拆', '拎', '拥',
        '抵', '拘', '势', '抱', '拄', '垃', '拉', '拦', '幸', '拌', '拧', '拂', '拙', '招', '坡', '披', '拨', '择', '抬', '拇', '拗', '其',
        '取', '茉', '苦', '昔', '苛', '若', '茂', '苹', '苗', '英', '苟', '苑',
        '苞', '范', '直', '茁', '茄', '茎', '苔', '茅', '枉', '林', '枝', '杯', '枢', '柜', '枚', '析', '板', '松', '枪', '枫', '构', '杭',
        '杰', '述', '枕', '丧', '或', '画', '卧', '事', '刺', '枣', '雨', '卖', '郁', '矾', '矿', '码', '厕', '奈', '奔', '奇', '奋', '态',
        '欧', '殴', '垄', '妻', '轰', '顷', '转', '斩', '轮', '软', '到', '非',
        '叔', '歧', '肯', '齿', '些', '卓', '虎', '虏', '肾', '贤', '尚', '旺', '具', '味', '果', '昆', '国', '哎', '咕', '昌', '呵', '畅',
        '明', '易', '咙', '昂', '迪', '典', '固', '忠', '呻', '咒', '咋', '咐', '呼', '鸣', '咏', '呢', '咄', '咖', '岸', '岩', '帖', '罗',
        '帜', '帕', '岭', '凯', '败', '账', '贩', '贬', '购', '贮', '图', '钓',
        '琇', '麸', '揶', '埴', '埯', '捯', '掳', '掴', '埸', '埵', '赧', '埤', '捭', '逵', '埝', '堋', '堍', '掬', '鸷', '掖', '捽', '掊',
        '堉', '掸', '捩', '掮', '悫', '埭', '埽', '掇', '掼', '聃', '菁', '萁', '菘', '堇', '萘', '萋', '菽', '菖', '萜', '萸', '萑', '棻',
        '菔', '菟', '萏', '萃', '菏', '菹', '菪', '菅', '菀', '萦', '菰', '菡',
        '梵', '梿', '梏', '觋', '桴', '桷', '梓', '棁', '桫', '棂', '啬', '郾', '匮', '敕', '豉', '鄄', '酞', '酚', '戛', '硎', '硭', '硒',
        '硖', '硗', '硐', '硇', '硌', '鸸', '瓠', '匏', '厩', '龚', '殒', '殓', '殍', '赉', '雩', '辄', '堑', '眭', '眦', '啧', '晡', '晤',
        '眺', '眵', '眸', '圊', '喏', '喵', '啉', '勖', '晞', '唵', '晗', '冕',
        '啭', '畦', '趺', '啮', '跄', '蚶', '蛄', '蛎', '蛆', '蚰', '蛊', '圉', '蚱', '蛉', '蛏', '蚴', '啁', '啕', '唿', '啐', '唼', '唷',
        '啖', '啵', '啶', '啷', '唳', '啜', '帻', '崚', '崦', '帼', '崮', '崤', '崆', '赇', '赈', '赊', '铑', '铒', '铗', '铙', '铟', '铠',
        '铡', '铢', '铣', '铤', '铧', '铨', '铩', '铪', '铫', '铬', '铮', '铯',
        '铰', '铱', '铳', '铵', '铷', '氪', '牾', '鸹', '秾', '逶', '笺', '筇', '笸', '笪', '笮', '笠', '笥', '笤', '笳', '笾', '笞', '偾',
        '偃', '偕', '偈', '傀', '偬', '偻', '皑', '皎', '鸻', '徜', '舸', '舻', '舴', '舷', '龛', '翎', '脬', '脘', '脲', '匐', '猗', '猡',
        '猞', '猝', '斛', '猕', '馗', '馃', '馄', '鸾', '孰', '庹', '庾', '痔',
        '痍', '疵', '翊', '旌', '旎', '袤', '阇', '阈', '阉', '阊', '阋', '阍', '阏', '羟', '粝', '粕', '敝', '焐', '烯', '焓', '烽', '焖',
        '烷', '焗', '渍', '渚', '淇', '淅', '淞', '渎', '涿', '淖', '挲', '淠', '涸', '渑', '淦', '淝', '淬', '涪', '淙', '涫', '渌', '淄',
        '惬', '悻', '悱', '惝', '惘', '悸', '惆', '惚', '惇', '惮', '窕', '谌',
        '谏', '扈', '皲', '谑', '裆', '袷', '裉', '谒', '谔', '谕', '谖', '谗', '谙', '谛', '谝', '逯', '郿', '隈', '粜', '隍', '隗', '婧',
        '婊', '婕', '娼', '婢', '婵', '胬', '袈', '翌', '恿', '欸', '绫', '骐', '绮', '绯', '绱', '骒', '绲', '骓', '绶', '绺', '绻', '绾',
        '骖', '缁', '耠', '琫', '琵', '琶', '琪', '瑛', '琦', '琥', '琨', '靓',
        '琰', '琮', '琯', '琬', '琛', '琚', '辇', '鼋', '揳', '堞', '搽', '揸', '揠', '堙', '趄', '揖', '颉', '塄', '揿', '耋', '揄', '蛩',
        '蛰', '塆', '摒', '揆', '掾', '聒', '葑', '葚', '靰', '靸', '葳', '葺', '葸', '萼', '葆', '葩', '葶', '蒌', '萱', '戟', '葭', '楮',
        '棼', '椟', '棹', '椤', '棰', '赍', '椋', '椁', '椪', '棣', '椐', '鹁',
        '覃', '酤', '酢', '酡', '鹂', '厥', '殚', '殛', '雯', '雱', '辊', '辋', '椠', '辍', '辎', '斐', '睄', '睑', '睇', '睃', '戢', '喋',
        '嗒', '喃', '喱', '喹', '晷', '喈', '跖', '跗', '跞', '跚', '跎', '跏', '跆', '蛱', '蛲', '蛭', '蛳', '蛐', '蛔', '蛞', '蛴', '蛟',
        '蛘', '喁', '喟', '啾', '嗖', '喑', '嗟', '喽', '嗞', '喀', '喔', '喙',
        '嵘', '嵖', '崴', '遄', '詈', '嵎', '崽', '嵬', '嵛', '嵯', '嵝', '嵫', '幄', '嵋', '铻', '铼', '铿', '锃', '锂', '锆', '锇', '锉',
        '锏', '锑', '锒', '锔', '锕', '掣', '矬', '氰', '毳', '毽', '犊', '犄', '犋', '鹄', '犍', '嵇', '黍', '稃', '稂', '筚', '筵', '筌',
        '傣', '傈', '舄', '牍', '傥', '傧', '遑', '傩', '遁', '徨', '媭', '畲',
        '弑', '颌', '翕', '釉', '鹆', '舜', '貂', '腈', '腌', '腓', '腆', '腴', '腑', '腚', '腱', '鱿', '鲀', '鲂', '颍', '猢', '猹', '猥',
        '飓', '觞', '觚', '猱', '颎', '飧', '馇', '馊', '亵', '脔', '裒', '痣', '痨', '痦', '痞', '痤', '痫', '痧', '赓', '竦', '瓿', '啻',
        '颏', '鹇', '阑', '阒', '阕', '粞', '遒', '孳', '焯', '焜', '焙', '焱',
        '鹈', '湛', '渫', '湮', '湎', '湜', '渭', '湍', '湫', '溲', '湟', '溆', '湲', '湔', '湉', '渥', '湄', '滁', '愠', '惺', '愦', '惴',
        '愀', '愎', '愔', '喾', '寐', '谟', '扉', '裢', '裎', '裥', '祾', '祺', '谠', '幂', '谡', '谥', '谧', '遐', '孱', '弼', '巽', '骘',
        '媪', '媛', '婷', '巯', '翚', '皴', '婺', '骛', '缂', '缃', '缄', '彘',
        '缇', '缈', '缌', '缑', '缒', '缗', '飨', '耢', '瑚', '瑁', '瑜', '瑗', '瑄', '瑕', '遨', '骜', '韫', '髡', '塬', '鄢', '趔', '趑',
        '摅', '摁', '蜇', '搋', '搪', '搐', '搛', '搠', '摈', '彀', '搦', '搡', '蓁', '戡', '蓍', '鄞', '靳', '蓐', '蓦', '鹋', '蒽', '蓓',
        '蓖', '蓊', '蒯', '蓟', '蓑', '蒿', '蒺', '蓠', '蒟', '蒡', '蒹', '蒴',
        '蒗', '蓥', '颐', '楔', '楠', '楂', '楝', '楫', '楸', '椴', '槌', '楯', '皙', '榈', '槎', '榉', '楦', '楣', '楹', '椽', '裘', '剽',
        '甄', '酮', '酰', '酯', '酩', '蜃', '碛', '碓', '硼', '碉', '碚', '碇', '碜', '鹌', '辏', '龃', '龅', '訾', '粲', '虞', '睚', '嗪',
        '韪', '嗷', '嗉', '睨', '睢', '雎', '睥', '嘟', '嗑', '嗫', '嗬', '嗔',
        '嗝', '戥', '嗄', '煦', '暄', '遢', '暌', '跬', '跶', '跸', '跐', '跣', '跹', '跻', '蛸', '蜊', '蜍', '蜉', '蜣', '畹', '蛹', '嗣',
        '嗯', '嗥', '嗲', '嗳', '嗌', '嗨', '嗐', '嗤', '嗵', '罨', '嵊', '嵩', '嵴', '骰', '锗', '锛', '锜', '锝', '锞', '锟', '锢', '锨',
        '锩', '锭', '锱', '雉', '氲', '犏', '歃', '稞', '稗', '稔', '筠', '筢',
        '筮', '筲', '筱', '牒', '煲', '敫', '徭', '愆', '艄', '觎', '毹', '貊', '貅', '貉', '颔', '腠', '腩', '腼', '腭', '腧', '塍', '媵',
        '詹', '鲅', '鲆', '鲇', '鲈', '稣', '鲋', '鲐', '肄', '鹐', '飕', '觥', '遛', '馐', '鹑', '亶', '瘃', '痱', '痼', '痿', '瘐', '瘁',
        '瘆', '麂', '裔', '歆', '旒', '雍', '阖', '阗', '阙', '羧', '豢', '粳',
        '猷', '煳', '煜', '煨', '煅', '煊', '煸', '煺', '滟', '溱', '溘', '漭', '滢', '溥', '溧', '溽', '裟', '溻', '溷', '滗', '滫', '溴',
        '滏', '滃', '滦', '溏', '滂', '滓', '溟', '滪', '愫', '慑', '慄', '慊', '鲎', '骞', '窦', '窠', '窣', '裱', '褚', '裨', '裾', '裰',
        '禊', '谩', '谪', '媾', '嫫', '媲', '嫒', '嫔', '媸', '缙', '缜', '缛',
        '辔', '骝', '缟', '缡', '缢', '缣', '骟', '耥', '璈', '瑶', '瑭', '獒', '觏', '慝', '嫠', '韬', '叆', '髦', '摽', '墁', '撂', '摞',
        '撄', '翥', '踅', '摭', '墉', '墒', '榖', '轂', '綦', '蔫', '蔷', '靺', '靼', '鞅', '靿', '甍', '蔸', '蔟', '蔺', '戬', '蕖', '蔻',
        '蓿', '斡', '鹕', '蓼', '榛', '榧', '榻', '榫', '榭', '槔', '榱', '槁',
        '槟', '槠', '榷', '僰', '酽', '酶', '酹', '厮', '碡', '碴', '碣', '碲', '磋', '臧', '豨', '殡', '霆', '霁', '辕', '蜚', '裴', '翡',
        '龇', '龈', '睿', '睽', '嘞', '嘈', '嘌', '嘁', '嘎', '暧', '暝', '踌', '踉', '蜞', '蜥', '蜮', '蝈', '蜴', '蜱', '蜩', '蜷', '蜿',
        '螂', '蜢', '嘘', '嘡', '鹗', '嘣', '嘤', '嘚', '嗾', '嘧', '罴', '罱',
        '幔', '嶂', '幛', '赙', '罂', '骷', '骶', '鹘', '锲', '锴', '锶', '锷', '锸', '锵', '镁', '镂', '犒', '箐', '箦', '箧', '箍', '箸',
        '箬', '箅', '箪', '箔', '箜', '箢', '箓', '毓', '僖', '儆', '僳', '僭', '劁', '僮', '魃', '魆', '睾', '艋', '鄱', '膈', '膑', '鲑',
        '鲔', '鲚', '鲛', '鲟', '獐', '觫', '雒', '夤', '馑', '銮', '塾', '麽',
        '瘌', '瘊', '瘘', '瘙', '廖', '韶', '旖', '膂', '阚', '鄯', '鲞', '粼', '粽', '糁', '槊', '鹚', '熘', '熥', '潢', '漤', '漕', '滹',
        '漯', '漶', '潋', '潴', '漪', '漉', '漳', '漩', '澉', '潍', '慵', '搴', '窨', '寤', '綮', '谮', '褡', '褙', '褓', '褛', '褊', '谯',
        '谰', '谲', '暨', '屣', '鹛', '嫣', '嫱', '嫖', '嫦', '嫚', '嫘', '嫡',
        '鼐', '翟', '瞀', '鹜', '骠', '缥', '缦', '缧', '缨', '骢', '缪', '缫', '耦', '耧', '瑾', '璜', '璀', '璎', '璁', '璋', '璇', '奭',
        '髯', '髫', '撷', '撅', '赭', '撸', '鋆', '撙', '撺', '墀', '聩', '觐', '鞑', '蕙', '鞒', '蕈', '蕨', '蕤', '蕞', '蕺', '瞢', '蕃',
        '蕲', '赜', '槿', '樯', '槭', '樗', '樘', '樊', '槲', '醌', '醅', '靥',
        '魇', '餍', '磔', '磙', '霈', '辘', '龉', '龊', '觑', '瞌', '瞋', '瞑', '嘭', '噎', '噶', '颙', '暹', '噘', '踔', '踝', '踟', '踒',
        '踬', '踮', '踯', '踺', '踞', '蝽', '蝾', '蝻', '蝰', '蝮', '螋', '蝓', '蝣', '蝼', '噗', '嘬', '颚', '噍', '噢', '噙', '噜', '噌',
        '噔', '颛', '幞', '幡', '嶙', '嶝', '骺', '骼', '骸', '镊', '镉', '镌',
        '镍', '镏', '镒', '镓', '镔', '稷', '箴', '篑', '篁', '篌', '篆', '牖', '儋', '徵', '磐', '虢', '鹞', '膘', '滕', '鲠', '鲡', '鲢',
        '鲣', '鲥', '鲧', '鲩', '獗', '獠', '觯', '馓', '馔', '麾', '廛', '瘛', '瘼', '瘢', '瘠', '齑', '羯', '羰', '遴', '糌', '糍', '糅',
        '熜', '熵', '熠', '澍', '澌', '潸', '潦', '潲', '鋈', '潟', '潼', '潽',
        '潺', '憬', '憧', '寮', '窳', '谳', '褴', '褟', '褫', '谵', '熨', '屦', '嬉', '勰', '戮', '蝥', '缬', '缮', '缯', '骣', '畿', '耩',
        '耨', '耪', '璞', '璟', '靛', '璠', '璘', '聱', '螯', '髻', '髭', '髹', '擀', '熹', '甏', '擞', '縠', '磬', '颞', '蕻', '鞘', '颟',
        '薤', '薨', '檠', '薏', '薮', '薜', '薅', '樾', '橛', '橇', '樵', '檎',
        '橹', '樽', '樨', '橼', '墼', '橐', '翮', '醛', '醐', '醍', '醚', '磺', '磲', '赝', '飙', '殪', '霖', '霏', '霓', '錾', '辚', '臻',
        '遽', '氅', '瞟', '瞠', '瞰', '嚄', '嚆', '噤', '暾', '蹀', '踹', '踵', '踽', '蹉', '蹁', '螨', '蟒', '螈', '螅', '螭', '螠', '螟',
        '噱', '噬', '噫', '噻', '噼', '罹', '圜', '䦃', '镖', '镗', '镘', '镚',
        '镛', '镝', '镞', '镠', '氇', '氆', '憩', '穑', '篝', '篥', '篦', '篪', '篙', '盥', '劓', '翱', '魉', '魈', '徼', '歙', '膳', '膦',
        '膙', '鲮', '鲱', '鲲', '鲳', '鲴', '鲵', '鲷', '鲻', '獴', '獭', '獬', '邂', '鹧', '廨', '赟', '瘰', '廪', '瘿', '瘵', '瘴', '癃',
        '瘳', '斓', '麇', '麈', '嬴', '壅', '羲', '糗', '瞥', '甑', '燎', '燠',
        '燔', '燧', '濑', '濉', '潞', '澧', '澹', '澥', '澶', '濂', '褰', '寰', '窸', '褶', '禧', '嬖', '犟', '隰', '嬗', '颡', '缱', '缲',
        '缳', '璨', '璩', '璐', '璪', '螫', '擤', '壕', '觳', '罄', '擢', '薹', '鞡', '鞬', '薷', '薰', '藓', '藁', '檄', '檩', '懋', '醢',
        '翳', '礅', '磴', '鹩', '龋', '龌', '豳', '壑', '黻', '嚏', '嚅', '蹑',
        '蹒', '蹊', '蟥', '螬', '螵', '疃', '螳', '蟑', '嚓', '羁', '罽', '罾', '嶷', '黜', '黝', '髁', '髀', '镡', '镢', '镣', '镦', '镧',
        '镩', '镪', '镫', '罅', '黏', '簌', '篾', '篼', '簖', '簋', '鼢', '黛', '儡', '鹪', '鼾', '皤', '魍', '龠', '繇', '貘', '邈', '貔',
        '臌', '膻', '臆', '臃', '鲼', '鲽', '鳀', '鳃', '鳅', '鳇', '鳊', '螽',
        '燮', '鹫', '襄', '糜', '縻', '膺', '癍', '麋', '懑', '濡', '濮', '濞', '濠', '濯', '蹇', '謇', '邃', '襁', '檗', '擘', '孺', '隳',
        '嬷', '蟊', '鹬', '鍪', '鏊', '鳌', '鬈', '鬃', '瞽', '鞯', '鞨', '鞫', '鞧', '鞣', '藜', '藠', '藩', '醪', '蹙', '礓', '燹', '餮',
        '瞿', '曛', '颢', '曜', '躇', '蹚', '鹭', '蟛', '蟪', '蟠', '蟮', '鹮',
        '黠', '黟', '髅', '髂', '镬', '镭', '镯', '馥', '簟', '簪', '鼬', '雠', '艟', '鳎', '鳏', '鳐', '癞', '癔', '癜', '癖', '糨', '蹩',
        '鎏', '懵', '彝', '邋', '鬏', '攉', '攒', '鞲', '鞴', '藿', '蘧', '蘅', '麓', '醮', '醯', '酃', '霪', '霭', '霨', '黼', '嚯', '蹰',
        '蹶', '蹽', '蹼', '蹴', '蹾', '蹿', '蠖', '蠓', '蟾', '蠊', '黢', '髋',
        '髌', '镲', '籀', '籁', '齁', '魑', '艨', '鳓', '鳔', '鳕', '鳗', '鳙', '麒', '鏖', '羸', '㸆', '瀚', '瀣', '瀛', '襦', '谶', '襞',
        '骥', '缵', '瓒', '攘', '蘩', '蘖', '醴', '霰', '酆', '矍', '曦', '躅', '鼍', '巉', '黩', '黥', '黪', '镳', '镴', '黧', '纂', '璺',
        '鼯', '臜', '鳜', '鳝', '鳟', '獾', '孀', '骧', '瓘', '鼙', '醺', '礴',
        '颦', '曩', '鳢', '癫', '麝', '夔', '爝', '灏', '禳', '鐾', '羼', '蠡', '耱', '懿', '蘸', '鹳', '霾', '氍', '饕', '躐', '髑', '镵',
        '穰', '饔', '鬻', '鬟', '趱', '攫', '攥', '颧', '躜', '鼹', '癯', '麟', '蠲', '蠹', '躞', '衢', '鑫', '灞', '襻', '纛', '鬣', '攮',
        '囔', '馕', '戆', '爨', '齉', '亍', '彳', '邒', '卬', '殳', '毌', '邘',
    ]
    print('-----------------------start:'+str(strftime("%Y-%m-%d %H:%M:%S", time.localtime()))+'-----------------------')
    for first_name in first_name_list:
        print('-------------------'+first_name+"-字：开始爬取-------------------")
        title = '失信被执行人名单'
        url_list = ['https://sp0.baidu.com/8aQDcjqpAAV3otqbppnN2DJv/api.php' \
                    '?resource_id=6899'
                    '&query=' + title + ''
                    '&cardNum='
                    '&iname=' + first_name + ''
                    '&areaName='
                    '&ie=utf-8'
                    '&oe=utf-8'
                    '&format=json'
                    '&t=1504228484424'
                    '&cb=jQuery110203450799221787775_1504227514772'
                    '&_=1504227514784'
                    ]
        # 爬取姓氏的前30页
        for page_num in range(0, 30):
            url_list.append(
                        'https://sp0.baidu.com/8aQDcjqpAAV3otqbppnN2DJv/api.php'
                        '?resource_id=6899'
                        '&query=' + title + ''
                        '&cardNum='
                        '&iname=' + first_name + ''
                        '&areaName='
                        '&pn='+str(page_num*10)+''
                        '&rn=10'
                        '&ie=utf-8'
                        '&oe=utf-8'
                        '&format=json'
                        '&t=1504259202271'
                        '&cb=jQuery110205604198048294293_1504254835087'
                        '&_=1504254835152'
                        )
        re_spider_page_data(url_list)
    print('-----------------------end:' + str(strftime("%Y-%m-%d %H:%M:%S", time.localtime())) + '-----------------------')
